DeltaNova/STM32/WS2812/ws2812.cpp
        //Sparkle(255,255,255,pixels,3); // White Sparkle
        //Sparkle(getRandomNumber(0,255),getRandomNumber(0,255),getRandomNumber(0,255),pixels,3);
        //CylonBounce(255,0,0,4,10,50);
        //Strobe(255,0x77,0,10,100,1000); //Slow
        //Strobe(255,255,255,10,50,1000); //Fast
        //Twinkle(255,0,0,10,100,false);
        //TwinkleRandom(20,100,false);
        //SnowSparkle(0x10, 0x10, 0x10, 20, getRandomNumber(100,1000));
        //RunningLights(255,255,0,50);  //Yellow
        //RunningLights(255,0,0,50); //RED
        //RunningLights(255,255,255,50);//WHITE
        //RunningLights(0,0,255,50); //BLUE
        //colorWipe(0x00,0xff,0x00, 50);
        //colorWipe(0x00,0x00,0x00, 50);
        //theaterChase(0xff,0,0,50);
        //Fire(55,120,15);
        ChristmasLights();
        

        
    }
}
 void ChristmasLightsStart(){
     // My Chrsitmas Light Display
        setAllRGB(0,0,0,pixels);
        writeLED(pixels,NUM_LEDS,DMA_Buffer);
        delay_ms(1000);
        
        setPixelRGB(25,0,0,0,pixels);
        writeLED(pixels,NUM_LEDS,DMA_Buffer);
        delay_ms(1000);
        
        setPixelRGB(25,0,0,1,pixels);
        writeLED(pixels,NUM_LEDS,DMA_Buffer);
        delay_ms(1000);
        setPixelRGB(25,0,0,2,pixels);
        writeLED(pixels,NUM_LEDS,DMA_Buffer);
        delay_ms(1000);
        setPixelRGB(25,0,0,3,pixels);
        writeLED(pixels,NUM_LEDS,DMA_Buffer);
        delay_ms(1000);
        setPixelRGB(25,0,0,4,pixels);
        writeLED(pixels,NUM_LEDS,DMA_Buffer);
        delay_ms(1000);
        setPixelRGB(25,0,0,5,pixels);
        writeLED(pixels,NUM_LEDS,DMA_Buffer);
        delay_ms(1000);
        setPixelRGB(25,0,0,6,pixels);
        writeLED(pixels,NUM_LEDS,DMA_Buffer);
        delay_ms(1000);
        
        setPixelRGB(50,0,0,4,pixels);
        writeLED(pixels,NUM_LEDS,DMA_Buffer);
        delay_ms(1000);
        
        setPixelRGB(50,0,0,2,pixels);
        writeLED(pixels,NUM_LEDS,DMA_Buffer);
        delay_ms(1000);
        
        setPixelRGB(50,0,0,3,pixels);
        writeLED(pixels,NUM_LEDS,DMA_Buffer);
        delay_ms(1000);
        
        setPixelRGB(128,0,0,2,pixels);
        setPixelRGB(128,0,0,3,pixels);
        setPixelRGB(128,0,0,4,pixels);
        writeLED(pixels,NUM_LEDS,DMA_Buffer);
        delay_ms(1000);
        uint8_t i;
        for (i=0; i < 10; i++){
            CylonBounce(255,0,0,4,10,50);
        }
}


void ChristmasLights(){
    uint8_t i;
    for (i=0; i < 6; i++){
        CylonBounce(255,255,255,4,10,50);
    }
    colorWipe(0x10,0x10,0x10,40);
    counter = 30000;
    while(counter){
        SnowSparkle(0x10, 0x10, 0x10, pixels, 20, getRandomNumber(100,1000));
    }
    
    Strobe(255,255,255,10,50,1000); //Fast
    
    colorWipe(0x32, 0x2d, 0x91,20);
    colorWipe(0xe6, 0xd1, 0x17,20);
    colorWipe(0x73, 0x12, 0x1f,20);
    colorWipe(0x61, 0xa3, 0xe6,20);
    colorWipe(0xe6, 0x89, 0x10,20);
    colorWipe(0x65, 0xbf, 0x74,20);
    
    CylonBounce(0x25,0x73,0x22,4,10,30);
    
    counter = 15000;
    while(counter){
        Sparkle(255,255,255,pixels,3); // White Sparkle
    }
    
    counter = 15000;
    while(counter){
        Sparkle(getRandomNumber(0,255),getRandomNumber(0,255),getRandomNumber(0,255),pixels,3);
    }
    

    RunningLights(255,255,255,30);//WHITE

    CylonBounce(0xad,0x1a,0x4b,4,10,30);

    for(i = 0; i<3; i++){
        theaterChase(0xff,0,0,30);
    }
    
    for(i = 0; i<3; i++){
        theaterChase(0x0c,0x5e,0x9c,20);
    }
    
     for(i = 0; i<3; i++){
        theaterChase(0x97,0x21,0x9C,10);
    }
    
    colorWipe(0xff, 0xbd, 0x38,20);
    colorWipe(0x17, 0xc5, 0x15,20);
    colorWipe(0x5c, 0x19, 0x1d,20);
    colorWipe(0x64, 0x37, 0x88,20);
    colorWipe(0xc4, 0x2d, 0xba,20);
    
    counter = 30000;
    while(counter){
        Fire(55,120,15);
    }
}




int getRandomNumber(int min, int max){
    // Generate a random number between min and max (inclusive)
    // Assumes std::srand() has already been called
    // Assumes max - min <= RAND_MAX
    static const double fraction = 1.0 / (RAND_MAX + 1.0);  // static used for efficiency, so we only calculate this value once
    // evenly distribute the random number across our range
    return min + static_cast<int>((max - min + 1) * (std::rand() * fraction));
}


void CylonBounce(uint8_t R, uint8_t G, uint8_t B, int EyeSize, int SpeedDelay, int ReturnDelay){
  for(int i = 0; i < NUM_LEDS-EyeSize-2; i++) {
    setAllRGB(0,0,0,pixels);
    setPixelRGB(R/10, G/10, B/10, i,pixels);
    for(int j = 1; j <= EyeSize; j++) {
      setPixelRGB(R, G, B, i+j, pixels); 
    }
    setPixelRGB(R/10, G/10, B/10, i+EyeSize+1, pixels);
    writeLED(pixels,NUM_LEDS, DMA_Buffer);
    delay_ms(SpeedDelay);
  }
  delay_ms(ReturnDelay);
  for(int i = NUM_LEDS-EyeSize-2; i > 0; i--) {
    setAllRGB(0,0,0,pixels);
    setPixelRGB(R/10, G/10, B/10,i,pixels);
    for(int j = 1; j <= EyeSize; j++) {
      setPixelRGB(R, G, B, i+j, pixels); 
    }
    setPixelRGB(R/10, G/10, B/10,i+EyeSize+1, pixels);
    writeLED(pixels,NUM_LEDS, DMA_Buffer);
    delay_ms(SpeedDelay);
  }
  delay_ms(ReturnDelay);

}

void RGBLoop(uint8_t (&array)[NUM_LEDS][3]){
  for(int j = 0; j < 3; j++ ) { 
    // Fade IN
    for(int k = 0; k < 256; k++) { 
      switch(j) { 
        case 0: setAllRGB(k,0,0,array); break;
        case 1: setAllRGB(0,k,0,array); break;
        case 2: setAllRGB(0,0,k,array); break;
      }

      writeLED(array,NUM_LEDS,DMA_Buffer);
      delay_ms(3);
    }

    // Fade OUT
    for(int k = 255; k >= 0; k--) { 
      switch(j) { 
        case 0: setAllRGB(k,0,0,array); break;
        case 1: setAllRGB(0,k,0,array); break;
        case 2: setAllRGB(0,0,k,array); break;
      }
      writeLED(array,NUM_LEDS,DMA_Buffer);
      delay_ms(3);
    }
  }
}


void Sparkle(uint8_t R, uint8_t G, uint8_t B, uint8_t (&array)[NUM_LEDS][3], uint8_t SpeedDelay) {

  uint8_t Pixel = getRandomNumber(0,NUM_LEDS);
  setPixelRGB(R,G,B,Pixel,array);
  writeLED(array,NUM_LEDS,DMA_Buffer);
  delay_ms(SpeedDelay);
  setPixelRGB(0,0,0,Pixel,array);
}

void SnowSparkle(uint8_t R, uint8_t G, uint8_t B, uint8_t (&array)[NUM_LEDS][3], uint16_t SparkleDelay, uint16_t SpeedDelay) {
    /*
     * SparkleDelay - Delay Time in ms (0-65535)
     * SpeedDelay   - Delay Time in ms (0-65535)
     * REQ: NUM_LEDS <= 255
     */
    
