DeltaNova/STM32/WS2812/ws2812.cpp
    // Compile Time Check for global NUM_LED value 
    static_assert(NUM_LEDS > 0, "SnowSparkle - NUM_LEDS needs to be > 0");
    static_assert(NUM_LEDS <= 255, "SnowSparkle - NUM_LEDS needs to be <= 255");
    
    setAllRGB(R,G,B,array);             // Fill LED Array with specified colour.
    uint8_t Pixel = getRandomNumber(0,NUM_LEDS);    // Pick an LED at random
  
    // Change the colour of the selected for a short ammount of time.
    setPixelRGB(0xff,0xff,0xff, Pixel,array); // Set LED Colour
    writeLED(array,NUM_LEDS,DMA_Buffer);      // Update ALL LEDs
    delay_ms(SparkleDelay);                   // Hold ALL LED colours
  
    setPixelRGB(R,G,B,Pixel,array);           // Set ALL LEDs to initial value
    writeLED(array,NUM_LEDS,DMA_Buffer);      // Update ALL LEDs.
    delay_ms(SpeedDelay);                     // Hold ALL LED colours.
}

void colorWipe(uint8_t R, uint8_t G, uint8_t B, uint8_t SpeedDelay) {
  for(uint8_t i=0; i<NUM_LEDS; i++) {
      setPixelRGB(R, G, B, i, pixels);
      writeLED(pixels,NUM_LEDS,DMA_Buffer);
      delay_ms(SpeedDelay);
  }
}
// TODO: ADD FadeInOut
// TODO: ADD rainbow cycle effect
// TODO: ADD Theatre Chase Rainbow Effect
// TODO@ ADD Bouncing Balls
// TODO: ADD Multi Colour Bouncing Balls
// TODO: ADD Meteor Rain Effect

void Fire(int Cooling, int Sparking, int SpeedDelay) {
  static uint8_t heat[NUM_LEDS];
  int cooldown;
  // Step 1.  Cool down every cell a little
  for( int i = 0; i < NUM_LEDS; i++) {
    cooldown = getRandomNumber(0, ((Cooling * 10) / NUM_LEDS) + 2);
    if(cooldown>heat[i]) {
      heat[i]=0;
    } else {
      heat[i]=heat[i]-cooldown;
    }
  }

  // Step 2.  Heat from each cell drifts 'up' and diffuses a little
  for( int k= NUM_LEDS - 1; k >= 2; k--) {
    heat[k] = (heat[k - 1] + heat[k - 2] + heat[k - 2]) / 3;
  }

  // Step 3.  Randomly ignite new 'sparks' near the bottom
  if( getRandomNumber(0,255) < Sparking ) {
    int y = getRandomNumber(0,7);
    heat[y] = heat[y] + getRandomNumber(160,255);
    //heat[y] = random(160,255);
  }

  // Step 4.  Convert heat to LED colors
  for( int j = 0; j < NUM_LEDS; j++) {
    setPixelHeatColor(j, heat[j] );
  }
  writeLED(pixels,NUM_LEDS,DMA_Buffer);
  
  delay_ms(SpeedDelay);
}

void setPixelHeatColor (uint8_t Pixel, uint8_t temperature) {
  // Scale 'heat' down from 0-255 to 0-191
  uint8_t t192 = round((temperature/255.0)*191);
  // calculate ramp up from
  uint8_t heatramp = t192 & 0x3F; // 0..63
  heatramp <<= 2; // scale up to 0..252

  // figure out which third of the spectrum we're in:
  if( t192 > 0x80) {                     // hottest
    setPixelRGB(255, 255, heatramp, Pixel, pixels);
  } else if( t192 > 0x40 ) {             // middle
    setPixelRGB(255, heatramp, 0, Pixel, pixels);
  } else {                               // coolest
    setPixelRGB(heatramp, 0, 0, Pixel, pixels);
  }
}


void theaterChase(uint8_t R, uint8_t G, uint8_t B, uint8_t SpeedDelay) {
  for (int j=0; j<10; j++) {  //do 10 cycles of chasing
    for (int q=0; q < 3; q++) {
      for (int i=0; i < NUM_LEDS; i=i+3) {
        setPixelRGB(R,G,B,i+q,pixels);    //turn every third pixel on
      }
      writeLED(pixels,NUM_LEDS,DMA_Buffer);
      delay_ms(SpeedDelay);
      for (int i=0; i < NUM_LEDS; i=i+3) {
        setPixelRGB(0,0,0,i+q,pixels);        //turn every third pixel off
      }
    }
  }
}


void RunningLights(uint8_t R, uint8_t G, uint8_t B,  uint8_t WaveDelay) {
  uint8_t Position=0;
  for(uint8_t j=0; j<NUM_LEDS*2; j++){
      Position++; // = 0; //Position + Rate;
      for(uint8_t i=0; i<NUM_LEDS; i++) {
        // sine wave, 3 offset waves make a rainbow!
        //float level = sin(i+Position) * 127 + 128;
        //setPixelRGB(level,0,0,i, pixels);
        //float level = sin(i+Position) * 127 + 128;
        setPixelRGB(((sin(i+Position) * 127 + 128)/255)*R,
                   ((sin(i+Position) * 127 + 128)/255)*G,
                   ((sin(i+Position) * 127 + 128)/255)*B,
                   i,pixels);
      }
      writeLED(pixels,NUM_LEDS,DMA_Buffer);
      delay_ms(WaveDelay);
  }
}

void Strobe(uint8_t R, uint8_t G, uint8_t B, uint8_t StrobeCount, uint16_t FlashDelay, uint16_t EndPause){

  for(int j = 0; j < StrobeCount; j++) {

    setAllRGB(R,G,B,pixels);
    writeLED(pixels,NUM_LEDS, DMA_Buffer);
    delay_ms(FlashDelay);
    setAllRGB(0,0,0,pixels);
    writeLED(pixels,NUM_LEDS, DMA_Buffer);
    delay_ms(FlashDelay);
  }
 delay_ms(EndPause);
}

void Twinkle(uint8_t R, uint8_t G, uint8_t B, uint8_t Count, uint8_t SpeedDelay, bool OnlyOne) {
  setAllRGB(0,0,0,pixels);
  for (uint8_t i=0; i<Count; i++) {
     setPixelRGB(R,G,B,getRandomNumber(0,NUM_LEDS),pixels);
     writeLED(pixels,NUM_LEDS, DMA_Buffer);
     delay_ms(SpeedDelay);
     if(OnlyOne) { 
       setAllRGB(0,0,0,pixels); 
     }
   }
  delay_ms(SpeedDelay);
}

void TwinkleRandom(uint8_t Count, uint8_t SpeedDelay, bool OnlyOne) {
  setAllRGB(0,0,0,pixels);
  for (uint8_t i=0; i<Count; i++) {
     setPixelRGB(getRandomNumber(0,255),getRandomNumber(0,255),getRandomNumber(0,255),getRandomNumber(0,NUM_LEDS),pixels);
     writeLED(pixels,NUM_LEDS, DMA_Buffer);
     delay_ms(SpeedDelay);
     if(OnlyOne) { 
       setAllRGB(0,0,0,pixels); 
     }
   }
  delay_ms(SpeedDelay);
}

    
void loadColour(uint8_t *colour, uint8_t *array, uint8_t offset){
    // Load a colour into an array. An offset is provided to enable
    // multiple colours to be loaded into the same array at differnt points.
    uint8_t i;
    /*
    // colour is an RGB Array
    // colour[0] = RED Component
    // colour[1] = GREEN Component
    // colour[2] = BLUE Component
    // Order for output array is GRB
    */
    for(i=0; i<8; i++){ // Load GREEN Component
        array[i+offset] = ((colour[1]<<i) & 0x80) ? 0x0F:0x09;
    }
    for(i=0; i<8; i++){ // Load RED Component (Offset by 8 bits from GREEN)
        array[i+offset+8] = ((colour[0]<<i) & 0x80) ? 0x0F:0x09;
    }
    for(i=0; i<8; i++){ // Load BLUE Component (Offset by 16 bits from GREEN)
        array[i+offset+16] = ((colour[2]<<i) & 0x80) ? 0x0F:0x09;
    }
   
